{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Good morning",
        "Good evening",
        "Hey there",
        "Greetings",
        "What's up",
        "How are you",
        "Hi Leo Club",
        "Hello Leo Club",
        "Good day"
      ],
      "responses": [
        "Hello! Welcome to Leo Club. How can I help you today?",
        "Hi there! I'm here to assist you with Leo Club information.",
        "Greetings! What would you like to know about our Leo Club?",
        "Hello! Ready to learn about Leadership, Experience, and Opportunity?"
      ]
    },
    {
      "tag": "about_leo",
      "patterns": [
        "What is Leo Club?",
        "Tell me about Leo Club",
        "What does Leo stand for?",
        "Leo Club information",
        "About Leo Club",
        "Leo Club mission",
        "What is the purpose of Leo Club?",
        "Leo Club objectives",
        "History of Leo Club",
        "Leo Club background"
      ],
      "responses": [
        "Leo Club is a youth organization sponsored by Lions Club International. LEO stands for Leadership, Experience, and Opportunity.",
        "Leo Clubs provide young people aged 12-30 with opportunities for leadership development and community service.",
        "Our Leo Club focuses on developing leadership skills while serving our community through various service projects.",
        "Leo Club was founded in 1967 and has grown to become the world's largest youth service organization."
      ]
    },
    {
      "tag": "membership",
      "patterns": [
        "How to join Leo Club?",
        "Membership requirements",
        "Can I become a member?",
        "Join Leo Club",
        "Membership process",
        "How to apply",
        "Age requirements",
        "Who can join Leo Club?",
        "Membership criteria",
        "Application process"
      ],
      "responses": [
        "To join our Leo Club, you must be between 12-30 years old and have a passion for community service.",
        "Membership is open to young people who want to develop leadership skills and serve their community.",
        "Contact our membership coordinator through this website for application details and meeting schedules.",
        "We welcome dedicated individuals who share our commitment to making a positive impact in the community."
      ]
    },
    {
      "tag": "activities",
      "patterns": [
        "What activities do you do?",
        "Leo Club projects",
        "Community service",
        "Events",
        "Activities",
        "What projects are you working on?",
        "Service projects",
        "Fundraising events",
        "Community outreach",
        "Environmental projects",
        "Youth programs"
      ],
      "responses": [
        "We organize various community service projects including environmental cleanups, food drives, and educational programs.",
        "Our activities include leadership workshops, fundraising events, and community outreach programs.",
        "We regularly participate in sight conservation projects, disaster relief efforts, and youth development programs.",
        "Recent projects include tree planting, blood donation drives, and literacy programs for underprivileged children."
      ]
    },
    {
      "tag": "meetings",
      "patterns": [
        "When do you meet?",
        "Meeting schedule",
        "Meeting times",
        "Where do you meet?",
        "Next meeting",
        "Meeting location",
        "Meeting frequency",
        "Club meetings",
        "When is the next meeting?"
      ],
      "responses": [
        "We meet every second Saturday of the month at 2 PM at the Community Center.",
        "Our regular meetings are held bi-weekly. Check our website for the current schedule.",
        "Meeting details are shared with members via email and our WhatsApp group.",
        "Meetings typically last 2 hours and include project planning, updates, and social activities."
      ]
    },
    {
      "tag": "leadership",
      "patterns": [
        "Leadership opportunities",
        "How to become a leader?",
        "Leadership roles",
        "Officer positions",
        "Leadership development",
        "Leadership training",
        "How to lead projects?",
        "Leadership skills"
      ],
      "responses": [
        "Leo Club offers various leadership positions including President, Vice President, Secretary, and Treasurer.",
        "We provide leadership training workshops and mentorship programs to develop your skills.",
        "Members can lead service projects, organize events, and represent the club at district meetings.",
        "Leadership opportunities grow as you gain experience and demonstrate commitment to our mission."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How to contact?",
        "Contact information",
        "Get in touch",
        "Reach out",
        "Phone number",
        "Email address",
        "Social media",
        "How can I reach you?",
        "Contact details"
      ],
      "responses": [
        "You can contact our Leo Club through this website's contact form.",
        "Reach out to our club officers through the contact page for more information.",
        "Follow us on social media for updates and connect with our community.",
        "Check our contact page for phone numbers, email addresses, and social media links."
      ]
    },
    {
      "tag": "events",
      "patterns": [
        "Upcoming events",
        "Events calendar",
        "What events do you have?",
        "Future events",
        "Event schedule",
        "Special events",
        "Annual events"
      ],
      "responses": [
        "Check our events page for upcoming activities and community service projects.",
        "We host annual events like charity walks, cultural festivals, and awareness campaigns.",
        "Our events calendar is regularly updated with meetings, service projects, and social gatherings.",
        "Join our mailing list to stay informed about all upcoming Leo Club events."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "See you later",
        "Thanks",
        "Thank you",
        "That's all",
        "Exit",
        "Quit",
        "Have a good day"
      ],
      "responses": [
        "Goodbye! Thank you for your interest in Leo Club. We hope to see you soon!",
        "Thanks for chatting! Feel free to contact us anytime for more information.",
        "Have a great day! Remember, Leo Club is always here to help you grow as a leader.",
        "See you later! Don't forget to check out our upcoming events and activities."
      ]
    }
  ]
}