{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Good morning",
                "Hey Leo Club UWU",
                "Greetings"
            ],
            "responses": [
                "Hello! Welcome to the Leo Club of Uva Wellassa University. How can I help you today?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "about_leo",
            "patterns": [
                "What is Leo Club?",
                "Tell me about Leo Club UWU",
                "What does LEO stand for?"
            ],
            "responses": [
                "Leo Club UWU is a student-led volunteer organization under Lions Clubs International. We focus on leadership, experience, and opportunity through community service."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_events",
            "patterns": [
                "What events do you organize?",
                "Tell me about Leo Club activities",
                "What kind of programs does Leo Club run?",
                "Leo Club projects"
            ],
            "responses": [
                "Leo Club organizes community service projects, leadership training sessions, awareness campaigns, and fun social events.",
                "We engage in volunteering, environmental activities, youth empowerment programs, and more!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_benefits",
            "patterns": [
                "Why should I join Leo Club?",
                "Benefits of being a Leo",
                "What do I gain from Leo Club?"
            ],
            "responses": [
                "You gain leadership skills, service experience, and the opportunity to connect with like-minded youth.",
                "It's a great way to make a difference in your community and build a strong resume."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_contact",
            "patterns": [
                "How can I contact Leo Club?",
                "Leo Club contact details",
                "Reach out to Leo Club"
            ],
            "responses": [
                "You can contact us via our official email or visit the Contact Us section on our website.",
                "Reach out on our social media pages or send an inquiry through our website."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_collaboration",
            "patterns": [
                "Can we collaborate with Leo Club?",
                "Partner with Leo Club",
                "Work with Leo Club"
            ],
            "responses": [
                "Yes! We're open to collaborating on community projects and initiatives. Please contact us with your proposal.",
                "We welcome partnerships that align with our mission. Let's make a difference together!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_uwu_vision",
            "patterns": [
                "What is your vision?",
                "Leo UWU vision",
                "Club vision statement"
            ],
            "responses": [
                "Our vision is: 'Let's build a team, Let's build a vision, Let's build a plan, Let's build success.' We are committed to a path of purposeful community impact and youth empowerment."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_uwu_mission",
            "patterns": [
                "What is your mission?",
                "Leo UWU mission",
                "Club mission statement"
            ],
            "responses": [
                "Our mission is to provide a unique platform for UWU undergraduates to develop leadership skills and create meaningful change through service. We aim to empower youth through impactful initiatives and global connections."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "history",
            "patterns": [
                "When did UWU Leo Club start?",
                "History of UWU Leo Club"
            ],
            "responses": [
                "The Leo Club of Uva Wellassa University (UWU Leos) was officially established on September 18, 2022. It was chartered during the \"Lumos '22\" installation ceremony, sponsored by the Lions Club of Uva Capital, held at the UWU campus in Badulla. Leo Club UWU was formed to inspire leadership and service among students. We are now one of the most active clubs in District 306 C2."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "vision",
            "patterns": [
                "What is the vision?",
                "Leo Club UWU vision"
            ],
            "responses": [
                "The club embraces the motto \"Servite Vel Relinquo\" (Latin for \"to serve or to leave\") and follows the theme:"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "mission",
            "patterns": [
                "What is the mission?",
                "Why does Leo Club UWU exist?"
            ],
            "responses": [
                "To provide a unique platform for undergraduates of Uva Wellassa University to develop leadership skills, nurture their personalities, and foster meaningful changes within their communities through impactful service initiatives. To create a friendly environment that offers infinite leadership experiences and opportunities for young people, forming new bonds within the global Leo and Lions network while focusing on community service."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leadership",
            "patterns": [
                "Who leads the club?",
                "Who is the president?"
            ],
            "responses": [
                "The club is led by an Executive Committee, including President, Secretary, Treasurer, and Directors. For the Leoistic year 2025/26, the club is proudly led by Leo Deshan Thilakarathne as the President."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "membership",
            "patterns": [
                "How to join?",
                "Join Leo Club"
            ],
            "responses": [
                "Undergraduates at UWU can apply via our website and pay the membership fee."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "membership_fees",
            "patterns": [
                "Membership fees?",
                "Renewal fees?"
            ],
            "responses": [
                "Our annual membership fee Rs.500 and its affordable and used to support club activities. Renewals happen annually."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "benefits",
            "patterns": [
                "Benefits of joining?",
                "Why join Leo Club?"
            ],
            "responses": [
                "Members develop leadership, teamwork skills, earn certificates, and contribute to meaningful projects."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "projects",
            "patterns": [
                "What kind of projects?",
                "What projects does the club do?"
            ],
            "responses": [
                "Our projects include education, environment, health, blood donations, and charity work. There are a lot of project categories."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "annual_events",
            "patterns": [
                "Annual events?",
                "Do you have yearly activities?"
            ],
            "responses": [
                "Yes, we organize annual Installation Ceremony, Leo photoshoot, signature projects and Leo's night."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "achievements",
            "patterns": [
                "Achievements?",
                "Awards won?"
            ],
            "responses": [
                "We have been recognized within District 306 C2 for leadership, innovation, and outstanding service. The Leo Club of Uva Wellassa University proudly marked a number of remarkable achievements at Resiliencia'24, the 19th Annual District Award Ceremony of Leo District 306 C2, held on 7th July 2024. Leo Erandini Ambalampitiya was awarded as the Most Outstanding Zone Director (Winner) and also recognized as the 1st Runner-Up for Most Outstanding Immediate Past President. Leo Abishek Haththakage secured the 1st Runner-Up position for Most Outstanding Bulletin Editor. The club was honored as the 2nd Runner-Up for Most Outstanding University-Based Omega Leo Club. Among project recognitions, the club received 1st Runner-Up for Best Project in Peace, Religious and Cultural Activities for the project සොකරි නාඩගම by Leo Nimeshika Perera, 2nd Runner-Up for Best Project in Youth Empowerment for Fortune Secret by Leo Chathumali Lankeshvara, and 2nd Runner-Up for Best Project in Fellowship for Leo's Trophy by Leo Sahan Madushka. In addition, the District President's Appreciation Awards were presented to Lion Shiraz Khan (Club Advisor), Leo Erandini Ambalampitiya (Council Officer), Leo Kirula Pramod (Club President), Leo Nimeshika Perera, and Leo Hansi Shaneesha in recognition of their valuable contributions throughout the Leoistic year."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "volunteering",
            "patterns": [
                "Can non-members help?",
                "Volunteer without membership?"
            ],
            "responses": [
                "Thank you for your interest, but volunteering is limited to registered Leo Club members only."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "propose_project",
            "patterns": [
                "How to suggest a project?",
                "Can I propose projects?"
            ],
            "responses": [
                "Members can submit project ideas through our website or directly to the committee."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leadership_programs",
            "patterns": [
                "Leadership programs?",
                "Workshops for leadership?"
            ],
            "responses": [
                "We organize leadership workshops, Leo Camps, and skills development programs regularly."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "upcoming_events",
            "patterns": [
                "Next event?",
                "Upcoming projects?"
            ],
            "responses": [
                "Check our 'Events' page on the website or our social media for upcoming activities."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leoistic_year",
            "patterns": [
                "What is Leoistic year?",
                "When does it start?"
            ],
            "responses": [
                "The Leoistic year runs from July to June, following Lions Clubs International guidelines."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_district",
            "patterns": [
                "What is Leo District 306 C2?",
                "Which district is UWU Leo Club in?",
                "Tell me about Leo District 306 C2"
            ],
            "responses": [
                "The Leo Club of UWU belongs to Leo District 306 C2, which is part of Lions Clubs International in Sri Lanka. This district connects many Leo Clubs across the region, promoting leadership and service through collaborative projects."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "types_of_leo_clubs",
            "patterns": [
                "How many types of Leo Clubs are there?",
                "Alpha or Omega Leo?",
                "Difference between Alpha and Omega Leo Club"
            ],
            "responses": [
                "There are two types of Leo Clubs: Alpha Leo Clubs for youth aged 12–18 and Omega Leo Clubs for young adults aged 18–30. Leo Club UWU is an Omega club."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "international_leo_day",
            "patterns": [
                "When is International Leo Day?",
                "What is Leo Day?",
                "Leo Day celebration?"
            ],
            "responses": [
                "International Leo Day is celebrated every year on December 5th to recognize Leos around the world for their community service and leadership."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "about_leoism",
            "patterns": [
                "What is Leoism?",
                "Define Leoism",
                "Meaning of Leoism"
            ],
            "responses": [
                "Leoism is the spirit of leadership, experience, and opportunity. It reflects the values of service, teamwork, and youth empowerment that guide all Leo Club activities."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "global_presence",
            "patterns": [
                "Is Leo Club international?",
                "How big is Leo Club worldwide?",
                "Leo Club in other countries?"
            ],
            "responses": [
                "Yes, Leo Clubs are international! They exist in over 140 countries and have more than 170,000 members globally, all dedicated to service and leadership."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_motto",
            "patterns": [
                "What is the motto of Leo Club?",
                "Leo Club motto?",
                "Leo mission statement?"
            ],
            "responses": [
                "The official motto of Leo Club is 'Leadership – Experience – Opportunity.' It defines our goal to develop young leaders through service."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_pins_and_awards",
            "patterns": [
                "Do Leos get pins or awards?",
                "What are Leo Club recognitions?",
                "Leo Club awards?"
            ],
            "responses": [
                "Yes, active Leos can receive pins, certificates, and awards for their leadership, volunteering hours, and contribution to projects. These recognitions come from the club, district, or Lions International."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_club_structure",
            "patterns": [
                "How is Leo Club organized?",
                "What are the positions in a Leo Club?",
                "Leo Club leadership roles?"
            ],
            "responses": [
                "Leo Clubs are structured with an executive committee that includes a President, Vice President, Secretary, Treasurer, and Directors for specific areas like membership, projects, and IT."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "difference_leo_lions",
            "patterns": [
                "What's the difference between Leo and Lions Club?",
                "Are Leo and Lions the same?",
                "Leo vs Lions Club"
            ],
            "responses": [
                "Leos are the youth wing (age 12–30) of Lions Clubs International. While Lions are adult volunteers, Leos are young leaders who serve under Lions' guidance and gradually transition to Lions as they grow."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_transition_to_lions",
            "patterns": [
                "Can Leos become Lions?",
                "How to join Lions after Leo?",
                "Do Leos graduate into Lions?"
            ],
            "responses": [
                "Yes! Leos are encouraged to become Lions after age 30. Their experience as Leos helps them take on stronger roles within Lions Clubs International."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "social_media",
            "patterns": [
                "Facebook page?",
                "Instagram page?"
            ],
            "responses": [
                "Youtube-https://youtube.com/@leoclubofuvawellassauniversity?si=9XEy22Km0TWDXcVg Facebook -https://www.facebook.com/leoclub.uwu?mibextid=LQQJ4d TikTok -https://www.tiktok.com/@uwuleos306c2?_t=8gt7VTTEbcv&_r=1 Instagram - https://instagram.com/leo_club_of_uwu?igshid=OGQ5ZDc2ODk2ZA== Linkedin-https://www.linkedin.com/company/leo-club-of-uva-wellassa-university/"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "faq_newsletter",
            "patterns": [
                "Newsletters?",
                "Updates?"
            ],
            "responses": [
                "We publish newsletters via our website and social media to share updates and achievements. As a member, you can also contribute by submitting your own newsletter entries. It's a great way to improve your score and stand out as the Most Outstanding Leo of the Month!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "contact",
            "patterns": [
                "How to contact?",
                "Contact details?"
            ],
            "responses": [
                "Visit our 'Contact Us' page or message us on Facebook or Instagram."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "contact_hours",
            "patterns": [
                "Office hours?",
                "Where is your office?"
            ],
            "responses": [
                "We operate from Uva Wellassa University. Contact us via website, as we don't have a fixed office."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "financial_transparency",
            "patterns": [
                "How are funds used?",
                "Donation transparency?"
            ],
            "responses": [
                "Funds are documented and used transparently for community projects."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "donation",
            "patterns": [
                "How to donate?",
                "Donation process?"
            ],
            "responses": [
                "You can donate goods or funds through our website or at events. Real-time updates are available."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "merchandise_store",
            "patterns": [
                "How to buy T-shirts?",
                "Merchandise store?"
            ],
            "responses": [
                "Visit our website to browse and purchase club merchandise securely online."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "website_navigation",
            "patterns": [
                "How to use website?",
                "Where is contact page?"
            ],
            "responses": [
                "Use the menu for Contact, Events, Members, and Projects. It's all organized for easy access."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "member_portal",
            "patterns": [
                "How to login?",
                "Member portal?"
            ],
            "responses": [
                "Login through the Member Portal to access your profile."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "learning_hub",
            "patterns": [
                "What is Learning Hub?",
                "Leadership lessons?"
            ],
            "responses": [
                "Our Learning Hub offers short modules on leadership and teamwork for certified learning."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "chatbot_help",
            "patterns": [
                "How to use chatbot?",
                "What can chatbot do?"
            ],
            "responses": [
                "You can ask me about membership, events, donations, and anything about UWU Leo Club."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "register_event",
            "patterns": [
                "How to register for events?",
                "Join an event?"
            ],
            "responses": [
                "You can register for events through our website's Events page. It's simple and quick."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_quotes",
            "patterns": [
                "Motivational quote?",
                "Leo club quote?"
            ],
            "responses": [
                "Leadership is not a position or title, it's action and example – That's what Leos believe."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_facts",
            "patterns": [
                "Leo club facts?",
                "Fun fact about Leo Club?"
            ],
            "responses": [
                "Leo Clubs exist in over 140 countries with thousands of active members globally."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "leo_day",
            "patterns": [
                "When is International Leo Day?",
                "Leo Day?"
            ],
            "responses": [
                "International Leo Day is celebrated every year on December 5th."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "district_info",
            "patterns": [
                "What is District 306 C2?",
                "District details?"
            ],
            "responses": [
                "We belong to Lions District 306 C2, which connects Leo Clubs across Sri Lanka."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "collaborations",
            "patterns": [
                "Partnerships?",
                "Collaborations?"
            ],
            "responses": [
                "We collaborate with other Leo Clubs, schools, and community organizations for service."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "out_of_scope",
            "patterns": [
                "Tell me a joke",
                "Weather today?",
                "Favorite movie?"
            ],
            "responses": [
                "I'm here to help with questions about Leo Club UWU, our members, projects, and activities."
            ],
            "context": [
                ""
            ]
        }
    ]
}